[
  {
    "id": 1,
    "title": "Personal Portfolio Website",
    "description": "Dynamic Website with & Next and React",
    "image": "/images/projects/react_portfolio1.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Webstack-Portfolio-Project",
    "previewUrl": "https://webstack-portfolio-project-alpha.vercel.app/",
    "skills": "Next.js React.js Tailwind CSS",
    "text": "This website serves as a collection of skills, experiences, and projects. The website provides a seamless and interactive user experience by leveraging the power of Next.js, React, and the aesthetic capabilities of Tailwind CSS. It's been meticulously designed to give visitors a comprehensive view of my journey while still maintaining a modern and captivating design.",
    "techskills": [
      "Next.js",
      "React.js",
      "TailwindCSS",
      "JavaScript",
      "HTML & CSS",
      "Git & GitHub",
      "Responsive Design",
      "API Integration",
      "State Management",
      "Framer Motion",
      "Type Animation",
      "React Hooks",
      "Redux (State Management)",
      "Client-Side Rendering"
    ],
    "features": [
      "The project: is meticulously architected to prioritize modularity, readability, and maintainability, ensuring robust scalability and enduring adaptability for optimal performance.",
      "Hero Section: A dynamic introduction that immediately captures attention, setting the tone for the rest of the portfolio.",
      "About Section: Delving deep into the background, this section narrates the personal and professional journey, and motivations.",
      "Skills Section: A concise showcase of the top skills, striking a balance between technical prowess and soft skills",
      "Projects Section: A list of projects, each with its unique story. This section stands as a testament to the hands-on experience and problem-solving capabilities.",
      "Books with Observables: An exploration into the world of Observables, detailing their use cases and advantages, especially in handling asynchronous tasks.",
      "Books with Promises: A dedicated section that dives into the intricacies of handling asynchronous operations using Promises in JavaScript.",
      "Like and Dislike Counter: An interactive feature allowing users to express their opinions on content. This section demonstrates responsive and user-friendly UI components.",
      "Email Section: An invitation for collaboration, this section provides a channel for visitors to reach out, fostering potential opportunities and partnerships."
    ]
  },
  {
    "id": 2,
    "title": "User Authentication System with MongoDB Atlas",
    "description": "SignIn and SignUp Forms with Vite, React & MongoDB",
    "image": "/images/projects/Forms.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Registration-Forms-with-database",
    "previewUrl": "",
    "skills": "UI/UX Design Data Validation Security & Authentication Backend API Development",
    "text": "Built on the foundation of Vite.js, React.js, and styled with Tailwind.css, this project offers a sleek, responsive, and user-friendly interface for both sign-in and sign-up processes. The backend is powered by Node.js and Express, and integrates middleware for added security, utilizing MongoDB Atlas with Mongoose for efficient data storage and management. The implementation showcases advanced user authentication mechanisms, error handling, rate limiting, and CORS setup, offering a highly scalable and robust system. The system allows users to seamlessly create accounts, delete them, or change their passwords, ensuring a comprehensive and intuitive user experience.",
    "techskills": [
      "Vite.js & React.js",
      "Node.js & Express.js",
      "Tailwind.css",
      "Middleware Integration",
      "MongoDB Atlas & Mongoose",
      "Yup & Regex Validation",
      "Lazy Loading",
      "ARIA Accessibility Standards",
      "Formik Form Management",
      "RESTful API Architecture",
      "JavaScript (ES6+)",
      "JWT (JSON Web Tokens)",
      "Bcrypt Hashing",
      "Dotenv & CORS Setup",
      "Express Rate Limiting",
      "Morgan (HTTP Request Logger)",
      "Cookie-parser"
    ],
    "features": [
      "Dynamic Form Loading: Implements lazy loading to enhance performance during form rendering.",
      "User Account Creation: Enables users to sign up using their email, phone number, and a secure password.",
      "Tailored Input Experience: A dedicated phone number input component ensures consistent and structured data collection.",
      "Password Strength Indicator: Provides real-time feedback on password strength, guiding users to set secure passwords.",
      "Data Validation: Utilizes the power of Yup for comprehensive and custom validation on both client and server sides.",
      "Regex Action Utility: An extra layer of password validation ensuring complexity and security.",
      "Rate Limiting: Ensures protection against brute force attacks or spammed requests.",
      "Advanced User Authentication: Features JWT for token generation and management, bcrypt for password hashing and validation, and custom error handling for seamless user experience.",
      "Structured Middleware: Implements middleware functions for error handling and authentication checks.",
      "The project architecture: emphasizes modularity, clarity, and maintainability while prioritizing scalability, guaranteeing enduring adaptability and operational efficiency."
    ]
  },
  {
    "id": 3,
    "title": "React Native App - Demo",
    "description": "Loyalty App for a Shopping with Special Offers",
    "image": "/images/projects/splash.webp",
    "tag": ["All", "Mobile"],
    "gitUrl": "https://github.com/carevicm/React-Native-App",
    "skills": "Mobile App Development, User Authentication & Database Management",
    "previewUrl": "https://clipchamp.com/watch/uVYRv28PAWE",
    "text": "The Geeky Deals Mobile App is a testament to modern mobile application development. It seamlessly integrates a frontend built with React Native and a backend powered by Node.js and Express. The app leverages MySQL as its primary database, managed through phpMyAdmin, ensuring efficient data storage and retrieval. With a clear focus on user management, the app offers features like user registration, login, and profile management. The intuitive navigation structure, combined with a sleek design, ensures a user-friendly experience. The application's codebase is organized, modular, and follows best practices, making it a prime example of a well-architected mobile app.",
    "techskills": [
      "React Native",
      "Node.js",
      "Express.js",
      "MySQL",
      "phpMyAdmin",
      "RESTful API Development",
      "JWT for Authentication",
      "Native-base",
      "Body-parser",
      "Async Storage",
      "JavaScript (ES6+)",
      "CSS"
    ],
    "features": [
      "User Management: Register, login, and manage user profiles with ease.",
      "Secure Authentication: Ensures user data is protected and only authenticated users gain access.",
      "Intuitive Navigation: Bottom tab navigator for easy access to main features and stack navigators for detailed user-related screens.",
      "Custom UI: Leveraging native-base for a consistent and modern user interface.",
      "Dynamic Data Retrieval: Efficiently fetches user data from a MySQL database using Node and Express.",
      "Error Handling: Robust error handling mechanisms for database operations.",
      "Custom Fonts: Integration of custom fonts for a unique user experience.",
      "Modular Codebase: Organized folder structure and modular code for easy maintenance and scalability."
    ]
  },
  {
    "id": 4,
    "title": "User Authentication System",
    "description": "SignIn and SignUp Forms with Vite, React & TailwindCSS",
    "image": "/images/projects/SignIn.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Registration-Forms",
    "previewUrl": "https://registration-forms-d9d10.web.app/signup",
    "skills": "Data Validation Security & Authentication, Backend API Development",
    "techskills": [
      "Vite.js",
      "React.js",
      "Tailwind.css",
      "UI/UX Design",
      "Node.js",
      "Express.js",
      "Middleware Integration",
      "MongoDB Atlas",
      "Mongoose ORM",
      "Yup Validation",
      "Lazy Loading",
      "Regex Validation",
      "ARIA Accessibility Standards",
      "Formik Form Management",
      "RESTful API Architecture",
      "JavaScript (ES6+)"
    ],
    "text": "Built on the foundation of Vite.js, React.js, and styled with Tailwind.css, this project offers a sleek, responsive, and user-friendly interface for both sign-in and sign-up processes. Backed by a robust Node.js and Express backend, it employs middleware for added security, utilizing MongoDB Atlas with Mongoose for efficient data storage and management. The system allows users to seamlessly create accounts, delete them, or change their passwords, ensuring a comprehensive and intuitive user experience.",
    "features": [
      "Dynamic Form Loading: Implements lazy loading to enhance performance during form rendering.",
      "User Account Creation: Enables users to sign up using their email, phone number, and a secure password",
      "Tailored Input Experience: A dedicated phone number input component ensures consistent and structured data collection.",
      "Password Strength Indicator: Provides real-time feedback on password strength, guiding users to set secure passwords.",
      "Data Validation: Utilizes the power of Yup for comprehensive and custom validation on both client and server sides.",
      "Regex Action Utility: An extra layer of password validation ensuring complexity and security.",
      "The project architecture emphasizes: modularity, clarity, and maintainability while prioritizing scalability, guaranteeing enduring adaptability and operational efficiency."
    ]
  },
  {
    "id": 5,
    "title": "Bootstrap Project",
    "description": "Responsive Website with Bootstrap",
    "image": "/images/projects/bootstrap_res_desgn.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Bootstrap_Project-Quantum",
    "previewUrl": "https://carevicm.github.io/Bootstrap_Project-Quantum/",
    "skills": "HTML CSS Bootstrap",
    "techskills": [
      "HTML & CSS",
      "Bootstrap",
      "JavaScript",
      "Event Listeners",
      "DOM Manipulation",
      "Responsive Design",
      "Responsive layout"
    ],
    "text": "This is a responsive website built with Bootstrap. It is a simple website with a few pages. It is fully responsive, for both desktop and mobile views. This gallery provides a visually appealing showcase suitable for various applications, ensuring optimal viewing on all devices.",
    "features": [
      "Responsive Design: Thanks to Bootstrap, the website adapts seamlessly to various screen sizes.",
      "Elegant UI: I've focused on creating a clean design, ensuring a sleek user experience.",
      "Carousel: An engaging carousel to showcase different features or products.",
      "Dynamic Image Loading: Efficiently loads images as they are needed, reducing initial page load times.",
      "Pricing Table: I've laid out various pricing options clearly for potential customers.",
      "Testimonials: A section for showcasing feedback from our satisfied customers.",
      "Smooth Transitions: Seamless switching between images for an uninterrupted viewing experience."
    ]
  },
  {
    "id": 6,
    "title": "Holberton School React.js Dashboard",
    "description": "Holberton School Dashboard",
    "image": "/images/projects/holberton.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Holberton_Project_React.js",
    "previewUrl": "https://carevicm.github.io/Holberton_Project_React.js/",
    "skills": "State Management, Data Normalization, User Authentication,Testing & Debugging",
    "text": "Experience a streamlined dashboard tailored for school-related tasks. Built with React and enhanced by Redux, the Holberton School Dashboard offers a blend of performance and aesthetics. Features like secure user authentication, tailored notifications, and a dynamic course list ensure a seamless user experience. The organized code structure, from actions to components, showcases best coding practices. With rigorous testing via Enzyme, the dashboard guarantees reliability. It's a modern solution for all school-related needs.",
    "techskills": [
      "React.js",
      "Redux",
      "UI/UX Design",
      "Immutable.js",
      "Aphrodite",
      "Jest",
      "Enzyme",
      "Redux action creators",
      "Redux reducers",
      "React components",
      "API Normalizers",
      "Unit Testing",
      "State Management",
      "Inline Styling",
      "PropTypes",
      "React Router",
      "JavaScript (ES6+)"
    ],
    "features": [
      "User Authentication: Secure login system with email and password.",
      "Notifications: Customizable alerts with filtering options.",
      "Course List: Dynamic display of available courses.",
      "Consistent UI: Unified footer and header across the platform.",
      "Responsive Design: Adaptable UI for various screen sizes.",
      "State Management: Efficient handling using Redux and Immutable.js.",
      "Styling: Modern aesthetics achieved with Aphrodite.",
      "Testing: Comprehensive unit tests using Enzyme.",
      "Error Handling: Robust mechanisms for a smooth user experience.",
      "Directory Structure: Modular and organized for maintainability."
    ]
  },
  {
    "id": 7,
    "title": "Bootstrap Project",
    "description": "Simple Responsive Website with Bootstrap",
    "image": "/images/projects/pawnsNmeet.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Bootstrap_Project-PawsNMeet",
    "previewUrl": "https://carevicm.github.io/Bootstrap_Project-PawsNMeet/",
    "skills": "HTML CSS Bootstrap Responsive Design",
    "text": "PawsNMeet is a conceptual web platform, meticulously crafted to demonstrate advanced web development skills. While the theme revolves around pet enthusiasts, the primary objective of this project is to showcase the potential of modern web design and development techniques.",
    "techskills": [
      "HTML",
      "CSS",
      "Bootstrap",
      "Responsive Design",
      "Web Integration",
      "Dynamic UI",
      "Navbar Design",
      "Carousel Implementation",
      "Animated Gradients",
      "Sectioned Content"
    ],
    "features": [
      "Adaptive Layout: Seamlessly adapts across various devices.",
      "Interactive UI: Incorporates carousels and animated gradients.",
      "Structured Content: Organized into distinct sections.",
      "Social Media Integration: Connects with external platforms.",
      "Responsive Navbar: Facilitates easy navigation through website sections.",
      "Testimonials Carousel: Showcases user feedback in an interactive manner.",
      "Diverse Pricing Plans: Demonstrates ability to present varied options to potential users.",
      "Footer Integration: Incorporates social media links and copyright information.",
      "Call to Action: Engaging section prompting user action.",
      "Press Logos: Displays potential media coverage or partnerships."
    ]
  },
  {
    "id": 8,
    "title": "Bootstrap Project",
    "description": "Responsive Design with Bootstrap",
    "image": "/images/projects/move_easy.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Responsive_Design-Bootstrap_Project_MoveEasy",
    "previewUrl": "https://carevicm.github.io/Responsive_Design-Bootstrap_Project_MoveEasy/",
    "skills": "HTML CSS Bootstrap Responsive Design",
    "text": "The MoveEasy webpage is a meticulously crafted project designed to showcase a range of web development skills. The site is built with a responsive design, ensuring a seamless user experience across various devices.",
    "techskills": [
      "HTML5",
      "CSS3",
      "Bootstrap 5",
      "Responsive Design",
      "JavaScript",
      "Responsive layout"
    ],
    "features": [
      "Adaptive Navigation: The navigation bar adjusts and provides expandable menus for enhanced user navigation.",
      "Engaging Main Section: The main banner dynamically adapts, showcasing engaging action buttons for user interaction.",
      "Visual Experience: An interactive slideshow that cycles through visuals, enhancing the user's visual experience.",
      "Organized Content Framework: Utilizes Bootstrap's grid framework to present content in a structured and appealing manner.",
      "Footer Enhancements: A detailed footer section with a columned layout, complemented by an email signup feature for user engagement.",
      "Social Media Integration: Direct links to popular social media platforms for increased connectivity and reach."
    ]
  },

  {
    "id": 9,
    "title": "JavaScript DOM Project",
    "description": "Dicee Game is a simple game of chance.",
    "image": "/images/projects/dicee_game.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/JavaScript_DOM-Dicee_Game",
    "previewUrl": "https://carevicm.github.io/JavaScript_DOM-Dicee_Game/",
    "skills": "HTMl CSS JavaScript DOM",
    "text": "The Dicee Game is a simple yet engaging web-based game where two players can roll the dice to determine the winner. Upon refreshing the page, each player's dice will display a random number between 1 and 6. The game then compares the two numbers and declares a winner or a draw. The game's design is not only visually captivating but also responsive, ensuring a seamless experience across various devices.",
    "techskills": [
      "HTML5",
      "CSS3",
      "Responsive Design",
      "JavaScript",
      "DOM Manipulation"
    ],
    "features": [
      "Random Dice Roll: On every refresh or load, the game simulates a dice roll for two players, displaying a random dice face for each.",
      "Dynamic Winner Declaration: The game evaluates the dice rolls and dynamically updates the heading to declare a winner or indicate a draw.",
      "Responsive Design: The game's layout and design adapt to various screen sizes, ensuring a consistent user experience across devices.",
      "Custom Fonts: Integration of unique fonts from Google Fonts to enhance the visual appeal.",
      "Interactive UI: The game provides immediate feedback on the outcome, enhancing user engagement.",
      "Simple Mechanics: No need for user input. Just refresh the page and get a new outcome!"
    ]
  },
  {
    "id": 10,
    "title": "jQuery Project",
    "description": "The Simon game is a memory-enhancing game ",
    "image": "/images/projects/Simon_Game.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/jQuery-Simon_Game",
    "previewUrl": "https://carevicm.github.io/jQuery-Simon_Game/",
    "skills": "HTMl CSS JavaScript jQuery",
    "text": "The Simon Game is a memory-based game where the user has to remember a sequence of colors and reproduce it correctly. The game starts with a single color, and with each successful repetition, another color is added to the sequence. The game utilizes vibrant color buttons that light up in a specific order, and the player's task is to reproduce the order by pressing the buttons. The game's difficulty increases as the sequence becomes longer, making it a fun and challenging experience.",
    "techskills": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "jQuery",
      "Responsive Design",
      "Javascript game"
    ],
    "features": [
      "Dynamic Level Progression: The game's difficulty increases with each level, challenging players with longer sequences.",
      "Interactive User Feedback: Players receive visual and auditory feedback based on their actions, enhancing engagement.",
      "Error Handling & Restart Option: In case of a wrong sequence, the game provides visual feedback and an option to restart, ensuring a user-friendly experience.",
      "Vibrant UI: The game features colorful buttons with gradient effects, creating an appealing visual experience.",
      "Hover & Press Effects: Buttons respond dynamically to user interactions with hover and press effects, providing tactile feedback.",
      "Adaptive Layout: The game's layout adjusts to different screen sizes, ensuring consistent gameplay on both mobile and desktop devices.",
      "Sound Effects: Integrated sound effects provide auditory cues, enhancing the gameplay experience."
    ]
  },
  {
    "id": 11,
    "title": "Drum Kit Web Application",
    "description": "An interactive web application that simulates a drum kit.",
    "image": "/images/projects/drum-Lesson.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/JavaScript-Drum_Lesson",
    "previewUrl": "https://carevicm.github.io/JavaScript-Drum_Lesson/",
    "skills": "HTMl CSS JavaScript jQuery",
    "text": "The Drum Kit web application is designed to provide users with a fun and engaging way to play drum sounds. With a simple and intuitive interface, users can click on the drum buttons or use their keyboard keys to produce various drum sounds. The application is built using HTML, CSS, and JavaScript, ensuring a smooth and responsive user experience. Whether you're a music enthusiast or just looking for a quick break, the Drum Kit app offers a delightful musical experience.",
    "techskills": [
      "HTML5",
      "CSS3",
      "JavaScript",
      "jQuery",
      "Responsive Design",
      "Javascript game",
      "DOM Manipulation",
      "Event Listeners"
    ],
    "features": [
      "Interactive UI: A user-friendly interface with clear drum buttons labeled with their respective keys, allowing users to easily identify and play the drum sounds.",
      "Multi-Input Support: The application supports both mouse clicks and keyboard inputs, providing flexibility in how users interact with the drum kit.",
      "Dynamic Sound Effects: Each drum button and corresponding keyboard key is mapped to a unique drum sound, offering a variety of sound effects to the user.",
      "Visual Feedback: Upon pressing a drum button or key, there's a visual change (button press animation) that provides immediate feedback to the user, enhancing the interactive experience.",
      "Responsive Design: The application is designed to adapt and look good on various screen sizes, ensuring a consistent user experience across devices.",
      "Custom Styling: Unique and eye-catching design with custom CSS properties like box-shadow, text-shadow, and border-radius.",
      "Optimized Performance: Efficient JavaScript code ensures quick response times and smooth playback of drum sounds.",
      "Footer Note: A footer section that can be used to provide additional information or links related to drum lessons or other related content."
    ]
  },
  {
    "id": 12,
    "title": "JSON-API",
    "description": "Dynamic Recipe Web Application",
    "image": "/images/projects/taco_project.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/JSON.API",
    "previewUrl": "https://json-api-cmop.onrender.com/",
    "skills": "Node.js Express.js Rest API JSON",
    "text": "Taco Town is a delightful and straightforward web application that combines various technologies to deliver a seamless and interactive user experience. From the client-side interactivity to the server-side data handling, each technology plays a crucial role in creating an efficient and dynamic web application. This project serves as an excellent example of modern web development practices.",
    "techskills": [
      "Node.js",
      "Express.js",
      "Body-Parser",
      "EJS",
      "Rest API",
      "JSON",
      "JavaScript",
      "HTML",
      "CSS"
    ],
    "features": [
      "HTML & CSS: The front end of the application is built using HTML5 and CSS3. HTML structures the content, while CSS is used for styling. The application features a responsive design with a focus on usability and aesthetics. The CSS includes custom styles for buttons, text, and layout, along with a unique background pattern created using SVG.",
      "JavaScript (Client-Side): Although not explicitly shown in the provided code, JavaScript may be used for handling user interactions in the browser, such as responding to button clicks.",
      "Node.js & Express.js: The backend of the application is powered by Node.js, with Express.js as the web application framework. Express.js simplifies the server-side logic, handling HTTP requests and responses with ease.",
      "EJS (Embedded JavaScript Templating): EJS is used as a templating engine to dynamically generate HTML pages based on the server-side data. It allows the insertion of JavaScript code into HTML, enabling dynamic content rendering.",
      "Body-Parser: This middleware is used in the Express.js application for parsing incoming request bodies. It's essential for handling POST requests, as it allows access to req.body.",
      "JSON: The recipes are stored in a JSON format, which is a lightweight data-interchange format. This makes it easy to store and retrieve recipe data, including details like ingredients, preparation methods, and prices.",
      "Application Logic: The server delivers HTML, CSS, and EJS templates, enabling users to select taco types on the main page. Upon selection, a POST request is processed, fetching the recipe from JSON data. The homepage then dynamically displays the recipe with detailed ingredients and preparation steps, complemented by responsive and aesthetically pleasing CSS styling."
    ]
  },
  {
    "id": 13,
    "title": "Server Side API Request",
    "description": "Web app with personalized activity suggestions",
    "image": "/images/projects/axios_request.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Server_Side_API_Request",
    "previewUrl": "https://server-side-api-request.onrender.com/",
    "skills": "Full Stack Development, API Integration, Error Handling",
  "text": "I'm Bored is an interactive web application designed to suggest activities to users based on their preferences. It features a clean, user-friendly interface built with HTML, CSS, and JavaScript. The backend, developed using Node.js and Express.js, interacts with the Bored API to fetch a variety of activities. Users can select the type of activity and the number of participants, and the app will provide a suitable suggestion. The application is designed to be responsive, ensuring a smooth experience across different devices and screen sizes. It also includes robust error handling for scenarios where no activities match the user's criteria.",
  "techskills": [
    "HTML",
    "JavaScript",
    "Node.js",
    "Express.js",
    "Axios",
    "Responsive Web Design",
    "CSS Media Queries",
    "API Integration",
    "EJS Templating",
    "Error Handling",
    "Form Handling",
    "Data Validation",
    "Git"
  ],
  "features": [
    "Dynamic Activity Suggestions: Offers a variety of activities based on user preferences.",
    "Customizable Options: Allows users to select activity types and participant numbers.",
    "Responsive Design: Ensures a seamless experience on both desktop and mobile devices.",
    "Error Handling: Gracefully manages scenarios with no matching activities.",
    "Interactive User Interface: Provides an engaging and easy-to-navigate interface.",
    "API Integration: Fetches real-time data from the Bored API for up-to-date suggestions.",
    "Robust Backend: Built with Node.js and Express.js for efficient server-side processing."
  ]
},
  {
    "id": 14,
    "title": "HTML Portfolio",
    "description": "Showcase of HTML Projects",
    "image": "/images/projects/html_projects.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/HTML-Portfolio/tree/main",
    "previewUrl": "https://carevicm.github.io/HTML-Portfolio/",
    "skills": "HTML CSS",
    "text": "Dive into the world of HTML creations, where each project is about coding and design passion. Projects range from movie rankings to birthday invitations and reflect attention to detail, design aesthetics, and user experience. ",
    "techskills": ["HTML5", "CSS3", "Responsive Web Design"],
    "features": [
      "Movie Ranking Project: A curated list of Milan's top three all-time favorite movies, providing a brief overview of each. Features include a detailed breakdown of each movie, engaging content that offers insight into Milan's movie preferences, and a clean and straightforward design for easy navigation.",
      "Birthday Invite Project: An interactive birthday invitation detailing the date, location, and what guests should bring. Features include vibrant visuals to set the celebratory mood, clear instructions for guests, and a direct Google Maps link for easy location access."
    ]
  },
  {
    "id": 15,
    "title": "AirBnb Clone Project",
    "description": "Web development at Holberton School. ",
    "image": "/images/projects/airbnbclone.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/AirBnb_Clone",
    "previewUrl": "https://carevicm.github.io/AirBnb_Clone/",
    "skills": "User Interface Responsive Design Web Development",
    "text": "Welcome to the AirBnb Clone project! This web application is designed to provide a user-friendly platform for finding and booking accommodations in various locations. Whether you're planning a vacation or a business trip, our application aims to make your stay comfortable and enjoyable.",
    "techskills": ["HTML5", "CSS3", "Responsive Design", "Responsive layout"],
    "features": [
      "User-Friendly Filters: Easily filter accommodations by state or amenities",
      "Search Functionality: Utilize the search button to find accommodations that match your criteria.",
      "Accommodation Listings: Browse through a variety of accommodations, each with detailed information.",
      "Accommodation Details: View essential details about each accommodation, including its name, price per night, and more.",
      "Owner Information: Get to know the owner of the accommodation, adding a personal touch to your stay.",
      "Amenity Information: Discover the amenities offered by each accommodation, ensuring you choose the one that fits your needs.",
      "User Reviews: Read reviews from previous guests to get a better understanding of the accommodation."
    ]
  },
  {
    "id": 16,
    "title": "Mondrian Project",
    "description": "CSS Grid creating Mondrian-style layout",
    "image": "/images/projects/mondrian_project.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Responsive_Design-Grid",
    "previewUrl": "https://carevicm.github.io/Responsive_Design-Grid/",
    "skills": "CSS Grid Layout Responsive Design",
    "text": "Welcome to my Mondrian-Inspired Digital Artwork project. Piet Mondrian, a renowned artist, captivated the world with his abstract compositions characterized by primary colors, bold black lines, and pristine white spaces. This project is a tribute to his genius, bringing his vision to life through the digital medium. The project is built using HTML and CSS, ensuring a smooth and responsive user experience. Whether you're an art enthusiast or just looking for a quick break, the Mondrian Project offers a delightful visual experience.",
    "techskills": ["HTML", "CSS", "CSS Grid Layout", "Responsive Design"],
    "features": [
      "CSS Grid Mastery: The layout intricately emulates Mondrian's style, showcasing the versatility and power of the CSS Grid system.",
      "Device Adaptability: While the artwork retains its dimensions for authenticity, its centered alignment ensures a seamless viewing experience across various devices.",
      "User Customization: Dive into the CSS and tweak the colors, sizes, or even the grid items in the HTML to craft your personalized Mondrian-esque masterpiece."
    ]
  },
  {
    "id": 17,
    "title": "Personal Website",
    "description": "",
    "image": "/images/projects/personal_website.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Personal-Website",
    "previewUrl": "https://carevicm.github.io/Personal-Website/",
    "skills": "HTML, CSS and Bootstrap",
    "text": "Welcome to a simple personal website example. Pixels meet passion here, and code comes to life. From intricate designs to fluid user interactions, every aspect of this site demonstrates a dedication to digital excellence. Explore my abilities, embark on a journey, and meet the coder behind the creations.",
    "techskills": [
      "HTML5 & CSS3",
      "Bootstrap 5",
      "User-Centric Design",
      "Seamless Web Development",
      "Digital Storytelling",
      "Responsive Design"
    ],
    "features": [
      "Engaging UI: A blend of aesthetics and functionality, ensuring every visitor's engagement.",
      "Mobile-Optimized: Crafted for screens of all sizes, ensuring a seamless experience everywhere.",
      "Visual Narratives: Iconography and imagery that tell a story, enhancing the site's narrative.",
      "Social Connect: One-click access to Milan's professional networks like LinkedIn, GitHub, and Instagram.",
      "Swift Interactions: Efficient coding ensures every click, scroll, and hover is responsive and smooth.",
      "Personal Touch: A dedicated contact section, inviting collaborations, queries, and connections."
    ]
  },
  {
    "id": 18,
    "title": "Flexbox Pricing Table",
    "description": "Fully responsive, for both desktop and mobile views",
    "image": "/images/projects/Flexbox_Pricing.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Responsive_Design-FlexBox",
    "previewUrl": "https://carevicm.github.io/Responsive_Design-FlexBox/",
    "skills": "Responsive Design Flexbox",
    "text": "Introducing the Flexbox Pricing Table, a seamless blend of aesthetics and functionality. Designed with precision, this table is a testament to the power of flexbox, offering a responsive and stylish solution for businesses to elegantly display their subscription tiers.",
    "techskills": ["Flexbox", "Responsive Design", "HTML", "CSS"],
    "features": [
      "Flexbox Proficiency: The table layout is meticulously crafted using Flexbox, demonstrating its capabilities in creating responsive and organized structures.",
      "Adaptive Design: The pricing table is designed to be fully responsive, ensuring a consistent and user-friendly experience across both desktop and mobile devices.",
      "Diverse Pricing Tiers: The table presents three clear and distinct pricing plans - Basic, Standard, and Premium, catering to a wide range of user needs.",
      "Engaging User Interaction: Each pricing tier is equipped with a vibrant 'Sign Up' button, ready to be linked and guide users to the next steps."
    ]
  },
  {
    "id": 19,
    "title": "CSS Projects",
    "description": "Showcase of CSS Projects",
    "image": "/images/projects/css_projects.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/CSS-Projects",
    "previewUrl": "https://carevicm.github.io/CSS-Projects/",
    "skills": "CSS3 HTML5",
    "text": " Dive into a trio of projects that encapsulate Milan Carevic's journey in the world of CSS. Each project, be it the vibrant flag of Laos, a quirky meme, or a responsive design agency, showcases a different skill set, all bound together by the common thread of impeccable CSS craftsmanship.",
    "techskills": ["CSS3", "HTML5", "Responsive Design with @media queries"],
    "features": [
      "Flag Project: A vivid representation of the Laotian flag, crafted purely using CSS. The design captures the essence of the flag with its distinct colors and central white circle, symbolizing the unity of the Laotian people. Features include CSS positioning, layering, and color manipulation.",
      "Meme Project: A light-hearted meme that humorously celebrates the triumphs of mastering CSS. The meme combines imagery with text to convey the joy of achieving a 'purr-fect' website design. Features include CSS styling, font integration, and image bordering.",
      "Web Design Agency Project: A mockup of a design agency's website, showcasing services in beauty and construction. The project stands out for its responsive design, ensuring a seamless user experience across devices. Features include responsive design using @media queries, CSS floats, and modern typography."
    ]
  },
  {
    "id": 20,
    "title": "Secrets Web Application",
    "description": "Password protection using Node and Express middleware",
    "image": "/images/projects/collage.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Node.js_Express.js-Secret_Page/tree/main",
    "previewUrl": "https://secret-page.onrender.com/",
    "skills": "Middleware Integration User Authentication Server Management",
    "text": "The Secrets Web Application is designed to simulate a password-protected portal where users can access a curated list of secrets. The primary goal of this project is to demonstrate the integration of user authentication mechanisms in web applications. The application is built using Express.js and features a minimalist yet functional user interface. Enter the password ILoveProgramming to access the secrets!",
    "techskills": [
      "JavaScript",
      "HTML",
      "Express.js",
      "Body-parser",
      "Morgan (Logging Middleware)",
      "Node.js",
      "User Authentication"
    ],
    "features": [
      "Middleware Integration: The application leverages middleware for user authentication, ensuring that only authorized users can access the secrets.",
      "Express.js Mastery: The server setup and management are efficiently handled using Express.js, showcasing its capabilities in building web applications.",
      "User Authentication: A password check function is integrated to authenticate users, providing an added layer of security to the secrets page.",
      "Responsive Web Design: The HTML pages are designed to be user-friendly, with clear headings and organized content layout.",
      "Curated Secrets: Upon successful login, users are presented with a curated list of intriguing secrets, enhancing user engagement.",
      "Logging Capabilities: The application integrates Morgan for logging, offering insights into server requests and aiding in debugging.",
      "Efficient Request Handling: The application is adept at handling both GET and POST requests, ensuring seamless user navigation and data submission."
    ]
  },
  {
    "id": 21,
    "title": "Node.js and Express.js",
    "description": "Band Name Generator",
    "image": "/images/projects/bandname.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Node.js_Express.js-Band_Name_Generator",
    "previewUrl": "https://band-name-generator-oev4.onrender.com/",
    "skills": "Node.js Express.js Middleware Integration",
    "text": "This application is designed to provide users with a unique band name based on their input. By combining the name of a street and a pet, we generate a band name that's both fun and memorable.",
    "techskills": [
      "Node.js",
      "Express.js",
      "Body-Parser",
      "Morgan",
      "JavaScript",
      "HTML"
    ],
    "features": [
      "Interactive User Input: Users can provide their street and pet names to generate a unique band name.",
      "Middleware Integration: Efficiently processes user input using Body-Parser and logs requests with Morgan.",
      "Responsive Web Design: Ensures a seamless user experience across various devices.",
      "Dynamic Band Name Generation: Combines user input to craft memorable band names."
    ]
  },
  {
    "id": 22,
    "title": "Online Resume",
    "description": "My Resume",
    "image": "/images/projects/resume.webp",
    "tag": ["All", "Web"],
    "gitUrl": "https://github.com/carevicm/Milan-Carevic-Resume",
    "previewUrl": "https://carevicm.github.io/Milan-Carevic-Resume/",
    "skills": "HTML CSS",
    "text": "Milan Carevic's digital resume showcases his extensive experience as a Full-Stack Software Developer with a strong background in designing, developing, and supporting cloud-native enterprise and consumer solutions. The resume highlights key strengths, work experience, educational background, certifications, and special skills.",
    "techskills": ["HTML5", "CSS3", "Responsive Design"],
    "features": [
      "Professional Header: A dedicated header section with personal details, contact information, and links to LinkedIn and GitHub profiles.",
      "Key Strengths Section: A concise list of professional strengths, emphasizing proficiency in full-stack development and cloud services.",
      "Work Experience: Detailed breakdown of professional journey, highlighting roles, responsibilities, and achievements.",
      "Educational Background: A comprehensive list of educational qualifications from renowned institutions.",
      "Certifications: A section dedicated to showcasing certifications in data analysis and AI.",
      "Special Skills: A detailed list of technical and soft skills, emphasizing expertise in frontend and backend technologies, database management, mobile app development, and more.",
      "Footer: A simple footer with copyright information."
    ]
  },
  {
    "id": 23,
    "title": "Coming soon",
    "description": "MEAN Stack Project",
    "image": "/images/projects/MEAN_Stack.webp",
    "tag": ["All", "Web", "Future"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 24,
    "title": "Coming soon",
    "description": "Vue.js Project",
    "image": "/images/projects/vue.webp",
    "tag": ["All", "Web", "Future"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 25,
    "title": "Coming soon",
    "description": "Python Project",
    "image": "/images/projects/PythonProject.webp",
    "tag": ["All", "Web", "Future"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 26,
    "title": "Coming soon",
    "description": "Mobile App with React Native",
    "image": "/images/projects/react_native.webp",
    "tag": ["All", "Mobile", "Coming soon"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 27,
    "title": "Coming soon",
    "description": "MERN App with React Native",
    "image": "/images/projects/mern.webp",
    "tag": ["All", "Mobile", "Coming soon"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 28,
    "title": "Coming soon",
    "description": "Vite.js Project",
    "image": "/images/projects/vite.webp",
    "tag": ["All", "Web", "Future"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  },
  {
    "id": 29,
    "title": "Coming soon",
    "description": "Angular Project",
    "image": "/images/projects/angular.webp",
    "tag": ["All", "Web", "Future"],
    "gitUrl": "/",
    "previewUrl": "/",
    "skills": "Future",
    "text": "Future",
    "techskills": ["List unavailable"],
    "features": ["Future: Stay tuned!"]
  }
]
